## Production: stepfunctions 🤖
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| add    | `aws_iam_policy.sfn_glue_policy`                            |
|        | `aws_iam_role.sfn_role`                                     |
|        | `aws_iam_role_policy_attachment.sfn_glue_policy_attachment` |
|        | `aws_sfn_state_machine.data_orchestrator`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.sfn_glue_policy will be created
  + resource "aws_iam_policy" "sfn_glue_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "DataLakeOrchestratorGluePolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "glue:StartJobRun",
                          + "glue:GetJobRuns",
                          + "glue:GetJobRun",
                          + "glue:GetJob",
                          + "glue:BatchStopJobRun",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:glue:ca-central-1:739275439843:job/*"
                    },
                  + {
                      + Action   = [
                          + "glue:UpdateTable",
                          + "glue:GetTables",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:DeleteTable",
                          + "glue:CreateTable",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:glue:ca-central-1:739275439843:table/*",
                          + "arn:aws:glue:ca-central-1:739275439843:database/*",
                          + "arn:aws:glue:ca-central-1:739275439843:catalog",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-production",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListMultipartUploadParts",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:DeleteObject",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-curated-production/*",
                          + "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.sfn_role will be created
  + resource "aws_iam_role" "sfn_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "DataLakeOrchestratorRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.sfn_glue_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sfn_glue_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "DataLakeOrchestratorRole"
    }

  # aws_sfn_state_machine.data_orchestrator will be created
  + resource "aws_sfn_state_machine" "data_orchestrator" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Orchestrates data pipeline jobs in parallel"
              + StartAt = "ParallelJobs"
              + States  = {
                  + AllJobsComplete = {
                      + Type = "Succeed"
                    }
                  + ParallelJobs    = {
                      + Branches = [
                          + {
                              + StartAt = "StartGCFormsJob"
                              + States  = {
                                  + GCFormsJobFailed = {
                                      + End    = true
                                      + Result = "GC Forms Glue job failed"
                                      + Type   = "Pass"
                                    }
                                  + StartGCFormsJob  = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + Next        = "GCFormsJobFailed"
                                            },
                                        ]
                                      + End        = true
                                      + Parameters = {
                                          + JobName = "Gc Forms Glue Job"
                                        }
                                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                                      + Type       = "Task"
                                    }
                                }
                            },
                          + {
                              + StartAt = "StartGCNotifyJob"
                              + States  = {
                                  + GCNotifyJobFailed = {
                                      + End    = true
                                      + Result = "GC Notify Glue job failed"
                                      + Type   = "Pass"
                                    }
                                  + StartGCNotifyJob  = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + Next        = "GCNotifyJobFailed"
                                            },
                                        ]
                                      + End        = true
                                      + Parameters = {
                                          + JobName = "Gc Notify Glue Job"
                                        }
                                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                                      + Type       = "Task"
                                    }
                                }
                            },
                          + {
                              + StartAt = "StartFreshdeskJob"
                              + States  = {
                                  + FreshdeskJobFailed = {
                                      + End    = true
                                      + Result = "Freshdesk Glue job failed"
                                      + Type   = "Pass"
                                    }
                                  + StartFreshdeskJob  = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + Next        = "FreshdeskJobFailed"
                                            },
                                        ]
                                      + End        = true
                                      + Parameters = {
                                          + JobName = "Freshdesk Glue Job"
                                        }
                                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                                      + Type       = "Task"
                                    }
                                }
                            },
                          + {
                              + StartAt = "StartSalesforceJob"
                              + States  = {
                                  + SalesforceJobFailed = {
                                      + End    = true
                                      + Result = "Salesforce Glue job failed"
                                      + Type   = "Pass"
                                    }
                                  + StartSalesforceJob  = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + Next        = "SalesforceJobFailed"
                                            },
                                        ]
                                      + End        = true
                                      + Parameters = {
                                          + JobName = "Salesforce Glue Job"
                                        }
                                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                                      + Type       = "Task"
                                    }
                                }
                            },
                        ]
                      + Next     = "AllJobsComplete"
                      + Type     = "Parallel"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "DataLakeOrchestrator"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sfn_glue_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sfn_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_sfn_state_machine.data_orchestrator"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
